## Introduction to Databases

### SQLite exercises (based on [this](https://www.w3resource.com/sqlite-exercises/) website)

In [5]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd

import sqlite3

![Db Schema](../SampleDBs/database-model.gif)

In [34]:
conn = sqlite3.connect(os.path.join('hr.sqlite'))
cur = conn.cursor()
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table'", conn)
df.head()

          name
0    countries
1      regions
2    locations
3  departments
4         jobs

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

In [5]:
cur.execute('Select first_name,last_name from employees')
print(cur.fetchall())

[('Steven', 'King'), ('Neena', 'Kochhar'), ('Lex', 'De Haan'), ('Alexander', 'Hunold'), ('Bruce', 'Ernst'), ('David', 'Austin'), ('Valli', 'Pataballa'), ('Diana', 'Lorentz'), ('Nancy', 'Greenberg'), ('Daniel', 'Faviet'), ('John', 'Chen'), ('Ismael', 'Sciarra'), ('Jose Manuel', 'Urman'), ('Luis', 'Popp'), ('Den', 'Raphaely'), ('Alexander', 'Khoo'), ('Shelli', 'Baida'), ('Sigal', 'Tobias'), ('Guy', 'Himuro'), ('Karen', 'Colmenares'), ('Matthew', 'Weiss'), ('Adam', 'Fripp'), ('Payam', 'Kaufling'), ('Shanta', 'Vollman'), ('Kevin', 'Mourgos'), ('Julia', 'Nayer'), ('Irene', 'Mikkilineni'), ('James', 'Landry'), ('Steven', 'Markle'), ('Laura', 'Bissot'), ('Mozhe', 'Atkinson'), ('James', 'Marlow'), ('TJ', 'Olson'), ('Jason', 'Mallin'), ('Michael', 'Rogers'), ('Ki', 'Gee'), ('Hazel', 'Philtanker'), ('Renske', 'Ladwig'), ('Stephen', 'Stiles'), ('John', 'Seo'), ('Joshua', 'Patel'), ('Trenna', 'Rajs'), ('Curtis', 'Davies'), ('Randall', 'Matos'), ('Peter', 'Vargas'), ('John', 'Russell'), ('Karen', 'Partners'), ('Alberto', 'Errazuriz'), ('Gerald', 'Cambrault'), ('Eleni', 'Zlotkey'), ('Peter', 'Tucker'), ('David', 'Bernstein'), ('Peter', 'Hall'), ('Christopher', 'Olsen'), ('Nanette', 'Cambrault'), ('Oliver', 'Tuvault'), ('Janette', 'King'), ('Patrick', 'Sully'), ('Allan', 'McEwen'), ('Lindsey', 'Smith'), ('Louise', 'Doran'), ('Sarath', 'Sewall'), ('Clara', 'Vishney'), ('Danielle', 'Greene'), ('Mattea', 'Marvins'), ('David', 'Lee'), ('Sundar', 'Ande'), ('Amit', 'Banda'), ('Lisa', 'Ozer'), ('Harrison', 'Bloom'), ('Tayler', 'Fox'), ('William', 'Smith'), ('Elizabeth', 'Bates'), ('Sundita', 'Kumar'), ('Ellen', 'Abel'), ('Alyssa', 'Hutton'), ('Jonathon', 'Taylor'), ('Jack', 'Livingston'), ('Kimberely', 'Grant'), ('Charles', 'Johnson'), ('Winston', 'Taylor'), ('Jean', 'Fleaur'), ('Martha', 'Sullivan'), ('Girard', 'Geoni'), ('Nandita', 'Sarchand'), ('Alexis', 'Bull'), ('Julia', 'Dellinger'), ('Anthony', 'Cabrio'), ('Kelly', 'Chung'), ('Jennifer', 'Dilly'), ('Timothy', 'Gates'), ('Randall', 'Perkins'), ('Sarah', 'Bell'), ('Britney', 'Everett'), ('Samuel', 'McCain'), ('Vance', 'Jones'), ('Alana', 'Walsh'), ('Kevin', 'Feeney'), ('Donald', 'OConnell'), ('Douglas', 'Grant'), ('Jennifer', 'Whalen'), ('Michael', 'Hartstein'), ('Pat', 'Fay'), ('Susan', 'Mavris'), ('Hermann', 'Baer'), ('Shelley', 'Higgins'), ('William', 'Gietz')]

+ Write a query to get unique department ID from employee table on the table "employees"

In [6]:
cur.execute('select employee_id from employees')
print(cur.fetchall())

[(100,), (101,), (102,), (103,), (104,), (105,), (106,), (107,), (108,), (109,), (110,), (111,), (112,), (113,), (114,), (115,), (116,), (117,), (118,), (119,), (120,), (121,), (122,), (123,), (124,), (125,), (126,), (127,), (128,), (129,), (130,), (131,), (132,), (133,), (134,), (135,), (136,), (137,), (138,), (139,), (140,), (141,), (142,), (143,), (144,), (145,), (146,), (147,), (148,), (149,), (150,), (151,), (152,), (153,), (154,), (155,), (156,), (157,), (158,), (159,), (160,), (161,), (162,), (163,), (164,), (165,), (166,), (167,), (168,), (169,), (170,), (171,), (172,), (173,), (174,), (175,), (176,), (177,), (178,), (179,), (180,), (181,), (182,), (183,), (184,), (185,), (186,), (187,), (188,), (189,), (190,), (191,), (192,), (193,), (194,), (195,), (196,), (197,), (198,), (199,), (200,), (201,), (202,), (203,), (204,), (205,), (206,)]

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

In [7]:
cur.execute('select* from employees order by first_name desc')
print(cur.fetchall())

[(180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', '1987-09-05', 'SH_CLERK', 3200, 0, 120, 50, None), (171, 'William', 'Smith', 'WSMITH', '011.44.1343.629268', '1987-08-27', 'SA_REP', 7400, 0.15, 148, 80, None), (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '1987-10-01', 'AC_ACCOUNT', 8300, 1, 205, 110, None), (195, 'Vance', 'Jones', 'VJONES', '650.501.4876', '1987-09-20', 'SH_CLERK', 2800, 0, 123, 50, None), (106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', '1987-06-23', 'IT_PROG', 4800, 0, 103, 60, None), (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', '1987-07-28', 'ST_CLERK', 3500, 0, 124, 50, None), (190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', '1987-09-15', 'SH_CLERK', 2900, 0, 122, 50, None), (170, 'Tayler', 'Fox', 'TFOX', '011.44.1343.729268', '1987-08-26', 'SA_REP', 9600, 0.2, 148, 80, None), (132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', '1987-07-19', 'ST_CLERK', 2100, 0, 121, 50, None), (203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '1987-09-28', 'HR_REP', 6500, 0, 101, 40, None), (173, 'Sundita', 'Kumar', 'SKUMAR', '011.44.1343.329268', '1987-08-29', 'SA_REP', 6100, 0.1, 148, 80, None), (166, 'Sundar', 'Ande', 'SANDE', '011.44.1346.629268', '1987-08-22', 'SA_REP', 6400, 0.1, 147, 80, None), (100, 'Steven', 'King', 'SKING', '515.123.4567', '1987-06-17', 'AD_PRES', 24000, 0, 0, 90, None), (128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', '1987-07-15', 'ST_CLERK', 2200, 0, 120, 50, None), (138, 'Stephen', 'Stiles', 'SSTILES', '650.121.2034', '1987-07-25', 'ST_CLERK', 3200, 0, 123, 50, None), (117, 'Sigal', 'Tobias', 'STOBIAS', '515.127.4564', '1987-07-04', 'PU_CLERK', 2800, 0, 114, 30, None), (116, 'Shelli', 'Baida', 'SBAIDA', '515.127.4563', '1987-07-03', 'PU_CLERK', 2900, 0, 114, 30, None), (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', '1987-09-30', 'AC_MGR', 12000, 1, 101, 110, None), (123, 'Shanta', 'Vollman', 'SVOLLMAN', '650.123.4234', '1987-07-10', 'ST_MAN', 6500, 0, 100, 50, None), (161, 'Sarath', 'Sewall', 'SSEWALL', '011.44.1345.529268', '1987-08-17', 'SA_REP', 7000, 0.25, 146, 80, None), (192, 'Sarah', 'Bell', 'SBELL', '650.501.1876', '1987-09-17', 'SH_CLERK', 4000, 0, 123, 50, None), (194, 'Samuel', 'McCain', 'SMCCAIN', '650.501.3876', '1987-09-19', 'SH_CLERK', 3200, 0, 123, 50, None), (137, 'Renske', 'Ladwig', 'RLADWIG', '650.121.1234', '1987-07-24', 'ST_CLERK', 3600, 0, 123, 50, None), (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', '1987-07-30', 'ST_CLERK', 2600, 0, 124, 50, None), (191, 'Randall', 'Perkins', 'RPERKINS', '650.505.4876', '1987-09-16', 'SH_CLERK', 2500, 0, 122, 50, None), (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', '1987-07-31', 'ST_CLERK', 2500, 0, 124, 50, None), (150, 'Peter', 'Tucker', 'PTUCKER', '011.44.1344.129268', '1987-08-06', 'SA_REP', 10000, 0.3, 145, 80, None), (152, 'Peter', 'Hall', 'PHALL', '011.44.1344.478968', '1987-08-08', 'SA_REP', 9000, 0.25, 145, 80, None), (122, 'Payam', 'Kaufling', 'PKAUFLIN', '650.123.3234', '1987-07-09', 'ST_MAN', 7900, 0, 100, 50, None), (157, 'Patrick', 'Sully', 'PSULLY', '011.44.1345.929268', '1987-08-13', 'SA_REP', 9500, 0.35, 146, 80, None), (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', '1987-09-27', 'MK_REP', 6000, 0, 201, 20, None), (155, 'Oliver', 'Tuvault', 'OTUVAULT', '011.44.1344.486508', '1987-08-11', 'SA_REP', 7000, 0.15, 145, 80, None), (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '1987-06-18', 'AD_VP', 17000, 0, 100, 90, None), (154, 'Nanette', 'Cambrault', 'NCAMBRAU', '011.44.1344.987668', '1987-08-10', 'SA_REP', 7500, 0.2, 145, 80, None), (184, 'Nandita', 'Sarchand', 'NSARCHAN', '650.509.1876', '1987-09-09', 'SH_CLERK', 4200, 0, 121, 50, None), (108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', '1987-06-25', 'FI_MGR', 12000, 0, 101, 100, None), (130, 'Mozhe', 'Atkinson', 'MATKINSO', '650.124.6234', '1987-07-17', 'ST_CLERK', 2800, 0, 121, 50, None), (134, 'Michael', 'Rogers', 'MROGERS', '650.127.1834', '1987-07-21', 'ST_CLERK', 2900, 0, 122, 50, None), (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', '1987-09-26', 'MK_MAN', 13000, 0, 100, 20, None), (120, 'Matthew', 'Weiss', 'MWEISS', '650.123.1234', '1987-07-07', 'ST_MAN', 8000, 0, 100, 50, None), (164, 'Mattea', 'Marvins', 'MMARVINS', '011.44.1346.329268', '1987-08-20', 'SA_REP', 7200, 0.1, 147, 80, None), (182, 'Martha', 'Sullivan', 'MSULLIVA', '650.507.9878', '1987-09-07', 'SH_CLERK', 2500, 0, 120, 50, None), (113, 'Luis', 'Popp', 'LPOPP', '515.124.4567', '1987-06-30', 'FI_ACCOUNT', 6900, 0, 108, 100, None), (160, 'Louise', 'Doran', 'LDORAN', '011.44.1345.629268', '1987-08-16', 'SA_REP', 7500, 0.3, 146, 80, None), (168, 'Lisa', 'Ozer', 'LOZER', '011.44.1343.929268', '1987-08-24', 'SA_REP', 11500, 0.25, 148, 80, None), (159, 'Lindsey', 'Smith', 'LSMITH', '011.44.1345.729268', '1987-08-15', 'SA_REP', 8000, 0.3, 146, 80, None), (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '1987-06-19', 'AD_VP', 17000, 0, 100, 90, None), (129, 'Laura', 'Bissot', 'LBISSOT', '650.124.5234', '1987-07-16', 'ST_CLERK', 3300, 0, 121, 50, None), (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', '1987-09-03', 'SA_REP', 7000, 0.15, 149, 0, None), (135, 'Ki', 'Gee', 'KGEE', '650.127.1734', '1987-07-22', 'ST_CLERK', 2400, 0, 122, 50, None), (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', '1987-07-11', 'ST_MAN', 5800, 0, 100, 50, None), (197, 'Kevin', 'Feeney', 'KFEENEY', '650.507.9822', '1987-09-22', 'SH_CLERK', 3000, 0, 124, 50, None), (188, 'Kelly', 'Chung', 'KCHUNG', '650.505.1876', '1987-09-13', 'SH_CLERK', 3800, 0, 122, 50, None), (119, 'Karen', 'Colmenares', 'KCOLMENA', '515.127.4566', '1987-07-06', 'PU_CLERK', 2500, 0, 114, 30, None), (146, 'Karen', 'Partners', 'KPARTNER', '011.44.1344.467268', '1987-08-02', 'SA_MAN', 13500, 0.3, 100, 80, None), (125, 'Julia', 'Nayer', 'JNAYER', '650.124.1214', '1987-07-12', 'ST_CLERK', 3200, 0, 120, 50, None), (186, 'Julia', 'Dellinger', 'JDELLING', '650.509.3876', '1987-09-11', 'SH_CLERK', 3400, 0, 121, 50, None), (140, 'Joshua', 'Patel', 'JPATEL', '650.121.1834', '1987-07-27', 'ST_CLERK', 2500, 0, 123, 50, None), (112, 'Jose Manuel', 'Urman', 'JMURMAN', '515.124.4469', '1987-06-29', 'FI_ACCOUNT', 7800, 0, 108, 100, None), (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', '1987-09-01', 'SA_REP', 8600, 0.2, 149, 80, None), (110, 'John', 'Chen', 'JCHEN', '515.124.4269', '1987-06-27', 'FI_ACCOUNT', 8200, 0, 108, 100, None), (139, 'John', 'Seo', 'JSEO', '650.121.2019', '1987-07-26', 'ST_CLERK', 2700, 0, 123, 50, None), (145, 'John', 'Russell', 'JRUSSEL', '011.44.1344.429268', '1987-08-01', 'SA_MAN', 14000, 0.4, 100, 80, None), (189, 'Jennifer', 'Dilly', 'JDILLY', '650.505.2876', '1987-09-14', 'SH_CLERK', 3600, 0, 122, 50, None), (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', '1987-09-25', 'AD_ASST', 4400, 0, 101, 10, None), (181, 'Jean', 'Fleaur', 'JFLEAUR', '650.507.9877', '1987-09-06', 'SH_CLERK', 3100, 0, 120, 50, None), (133, 'Jason', 'Mallin', 'JMALLIN', '650.127.1934', '1987-07-20', 'ST_CLERK', 3300, 0, 122, 50, None), (156, 'Janette', 'King', 'JKING', '011.44.1345.429268', '1987-08-12', 'SA_REP', 10000, 0.35, 146, 80, None), (127, 'James', 'Landry', 'JLANDRY', '650.124.1334', '1987-07-14', 'ST_CLERK', 2400, 0, 120, 50, None), (131, 'James', 'Marlow', 'JAMRLOW', '650.124.7234', '1987-07-18', 'ST_CLERK', 2500, 0, 121, 50, None), (177, 'Jack', 'Livingston', 'JLIVINGS', '011.44.1644.429264', '1987-09-02', 'SA_REP', 8400, 0.2, 149, 80, None), (111, 'Ismael', 'Sciarra', 'ISCIARRA', '515.124.4369', '1987-06-28', 'FI_ACCOUNT', 7700, 0, 108, 100, None), (126, 'Irene', 'Mikkilineni', 'IMIKKILI', '650.124.1224', '1987-07-13', 'ST_CLERK', 2700, 0, 120, 50, None), (204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', '1987-09-29', 'PR_REP', 10000, 0, 101, 70, None), (136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634', '1987-07-23', 'ST_CLERK', 2200, 0, 122, 50, None), (169, 'Harrison', 'Bloom', 'HBLOOM', '011.44.1343.829268', '1987-08-25', 'SA_REP', 10000, 0.2, 148, 80, None), (118, 'Guy', 'Himuro', 'GHIMURO', '515.127.4565', '1987-07-05', 'PU_CLERK', 2600, 0, 114, 30, None), (183, 'Girard', 'Geoni', 'GGEONI', '650.507.9879', '1987-09-08', 'SH_CLERK', 2800, 0, 120, 50, None), (148, 'Gerald', 'Cambrault', 'GCAMBRAU', '011.44.1344.619268', '1987-08-04', 'SA_MAN', 11000, 0.3, 100, 80, None), (174, 'Ellen', 'Abel', 'EABEL', '011.44.1644.429267', '1987-08-30', 'SA_REP', 11000, 0.3, 149, 80, None), (172, 'Elizabeth', 'Bates', 'EBATES', '011.44.1343.529268', '1987-08-28', 'SA_REP', 7300, 0.15, 148, 80, None), (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', '1987-08-05', 'SA_MAN', 10500, 0.2, 100, 80, None), (199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', '1987-09-24', 'SH_CLERK', 2600, 0, 124, 50, None), (198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833', '1987-09-23', 'SH_CLERK', 2600, 0, 124, 50, None), (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', '1987-06-24', 'IT_PROG', 4200, 0, 103, 60, None), (114, 'Den', 'Raphaely', 'DRAPHEAL', '515.127.4561', '1987-07-01', 'PU_MAN', 11000, 0, 100, 30, None), (105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', '1987-06-22', 'IT_PROG', 4800, 0, 103, 60, None), (151, 'David', 'Bernstein', 'DBERNSTE', '011.44.1344.345268', '1987-08-07', 'SA_REP', 9500, 0.25, 145, 80, None), (165, 'David', 'Lee', 'DLEE', '011.44.1346.529268', '1987-08-21', 'SA_REP', 6800, 0.1, 147, 80, None), (163, 'Danielle', 'Greene', 'DGREENE', '011.44.1346.229268', '1987-08-19', 'SA_REP', 9500, 0.15, 147, 80, None), (109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', '1987-06-26', 'FI_ACCOUNT', 9000, 0, 108, 100, None), (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', '1987-07-29', 'ST_CLERK', 3100, 0, 124, 50, None), (162, 'Clara', 'Vishney', 'CVISHNEY', '011.44.1346.129268', '1987-08-18', 'SA_REP', 10500, 0.25, 147, 80, None), (153, 'Christopher', 'Olsen', 'COLSEN', '011.44.1344.498718', '1987-08-09', 'SA_REP', 8000, 0.2, 145, 80, None), (179, 'Charles', 'Johnson', 'CJOHNSON', '011.44.1644.429262', '1987-09-04', 'SA_REP', 6200, 0.1, 149, 80, None), (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '1987-06-21', 'IT_PROG', 6000, 0, 103, 60, None), (193, 'Britney', 'Everett', 'BEVERETT', '650.501.2876', '1987-09-18', 'SH_CLERK', 3900, 0, 123, 50, None), (187, 'Anthony', 'Cabrio', 'ACABRIO', '650.509.4876', '1987-09-12', 'SH_CLERK', 3000, 0, 121, 50, None), (167, 'Amit', 'Banda', 'ABANDA', '011.44.1346.729268', '1987-08-23', 'SA_REP', 6200, 0.1, 147, 80, None), (175, 'Alyssa', 'Hutton', 'AHUTTON', '011.44.1644.429266', '1987-08-31', 'SA_REP', 8800, 0.25, 149, 80, None), (158, 'Allan', 'McEwen', 'AMCEWEN', '011.44.1345.829268', '1987-08-14', 'SA_REP', 9000, 0.35, 146, 80, None), (185, 'Alexis', 'Bull', 'ABULL', '650.509.2876', '1987-09-10', 'SH_CLERK', 4100, 0, 121, 50, None), (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', '1987-06-20', 'IT_PROG', 9000, 0, 102, 60, None), (115, 'Alexander', 'Khoo', 'AKHOO', '515.127.4562', '1987-07-02', 'PU_CLERK', 3100, 0, 114, 30, None), (147, 'Alberto', 'Errazuriz', 'AERRAZUR', '011.44.1344.429278', '1987-08-03', 'SA_MAN', 12000, 0.3, 100, 80, None), (196, 'Alana', 'Walsh', 'AWALSH', '650.507.9811', '1987-09-21', 'SH_CLERK', 3100, 0, 124, 50, None), (121, 'Adam', 'Fripp', 'AFRIPP', '650.123.2234', '1987-07-08', 'ST_MAN', 8200, 0, 100, 50, None)]

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

In [8]:
cur.execute('select first_name, last_name, salary, salary*0.12 from employees')
print(cur.fetchall())

[('Steven', 'King', 24000, 2880.0), ('Neena', 'Kochhar', 17000, 2040.0), ('Lex', 'De Haan', 17000, 2040.0), ('Alexander', 'Hunold', 9000, 1080.0), ('Bruce', 'Ernst', 6000, 720.0), ('David', 'Austin', 4800, 576.0), ('Valli', 'Pataballa', 4800, 576.0), ('Diana', 'Lorentz', 4200, 504.0), ('Nancy', 'Greenberg', 12000, 1440.0), ('Daniel', 'Faviet', 9000, 1080.0), ('John', 'Chen', 8200, 984.0), ('Ismael', 'Sciarra', 7700, 924.0), ('Jose Manuel', 'Urman', 7800, 936.0), ('Luis', 'Popp', 6900, 828.0), ('Den', 'Raphaely', 11000, 1320.0), ('Alexander', 'Khoo', 3100, 372.0), ('Shelli', 'Baida', 2900, 348.0), ('Sigal', 'Tobias', 2800, 336.0), ('Guy', 'Himuro', 2600, 312.0), ('Karen', 'Colmenares', 2500, 300.0), ('Matthew', 'Weiss', 8000, 960.0), ('Adam', 'Fripp', 8200, 984.0), ('Payam', 'Kaufling', 7900, 948.0), ('Shanta', 'Vollman', 6500, 780.0), ('Kevin', 'Mourgos', 5800, 696.0), ('Julia', 'Nayer', 3200, 384.0), ('Irene', 'Mikkilineni', 2700, 324.0), ('James', 'Landry', 2400, 288.0), ('Steven', 'Markle', 2200, 264.0), ('Laura', 'Bissot', 3300, 396.0), ('Mozhe', 'Atkinson', 2800, 336.0), ('James', 'Marlow', 2500, 300.0), ('TJ', 'Olson', 2100, 252.0), ('Jason', 'Mallin', 3300, 396.0), ('Michael', 'Rogers', 2900, 348.0), ('Ki', 'Gee', 2400, 288.0), ('Hazel', 'Philtanker', 2200, 264.0), ('Renske', 'Ladwig', 3600, 432.0), ('Stephen', 'Stiles', 3200, 384.0), ('John', 'Seo', 2700, 324.0), ('Joshua', 'Patel', 2500, 300.0), ('Trenna', 'Rajs', 3500, 420.0), ('Curtis', 'Davies', 3100, 372.0), ('Randall', 'Matos', 2600, 312.0), ('Peter', 'Vargas', 2500, 300.0), ('John', 'Russell', 14000, 1680.0), ('Karen', 'Partners', 13500, 1620.0), ('Alberto', 'Errazuriz', 12000, 1440.0), ('Gerald', 'Cambrault', 11000, 1320.0), ('Eleni', 'Zlotkey', 10500, 1260.0), ('Peter', 'Tucker', 10000, 1200.0), ('David', 'Bernstein', 9500, 1140.0), ('Peter', 'Hall', 9000, 1080.0), ('Christopher', 'Olsen', 8000, 960.0), ('Nanette', 'Cambrault', 7500, 900.0), ('Oliver', 'Tuvault', 7000, 840.0), ('Janette', 'King', 10000, 1200.0), ('Patrick', 'Sully', 9500, 1140.0), ('Allan', 'McEwen', 9000, 1080.0), ('Lindsey', 'Smith', 8000, 960.0), ('Louise', 'Doran', 7500, 900.0), ('Sarath', 'Sewall', 7000, 840.0), ('Clara', 'Vishney', 10500, 1260.0), ('Danielle', 'Greene', 9500, 1140.0), ('Mattea', 'Marvins', 7200, 864.0), ('David', 'Lee', 6800, 816.0), ('Sundar', 'Ande', 6400, 768.0), ('Amit', 'Banda', 6200, 744.0), ('Lisa', 'Ozer', 11500, 1380.0), ('Harrison', 'Bloom', 10000, 1200.0), ('Tayler', 'Fox', 9600, 1152.0), ('William', 'Smith', 7400, 888.0), ('Elizabeth', 'Bates', 7300, 876.0), ('Sundita', 'Kumar', 6100, 732.0), ('Ellen', 'Abel', 11000, 1320.0), ('Alyssa', 'Hutton', 8800, 1056.0), ('Jonathon', 'Taylor', 8600, 1032.0), ('Jack', 'Livingston', 8400, 1008.0), ('Kimberely', 'Grant', 7000, 840.0), ('Charles', 'Johnson', 6200, 744.0), ('Winston', 'Taylor', 3200, 384.0), ('Jean', 'Fleaur', 3100, 372.0), ('Martha', 'Sullivan', 2500, 300.0), ('Girard', 'Geoni', 2800, 336.0), ('Nandita', 'Sarchand', 4200, 504.0), ('Alexis', 'Bull', 4100, 492.0), ('Julia', 'Dellinger', 3400, 408.0), ('Anthony', 'Cabrio', 3000, 360.0), ('Kelly', 'Chung', 3800, 456.0), ('Jennifer', 'Dilly', 3600, 432.0), ('Timothy', 'Gates', 2900, 348.0), ('Randall', 'Perkins', 2500, 300.0), ('Sarah', 'Bell', 4000, 480.0), ('Britney', 'Everett', 3900, 468.0), ('Samuel', 'McCain', 3200, 384.0), ('Vance', 'Jones', 2800, 336.0), ('Alana', 'Walsh', 3100, 372.0), ('Kevin', 'Feeney', 3000, 360.0), ('Donald', 'OConnell', 2600, 312.0), ('Douglas', 'Grant', 2600, 312.0), ('Jennifer', 'Whalen', 4400, 528.0), ('Michael', 'Hartstein', 13000, 1560.0), ('Pat', 'Fay', 6000, 720.0), ('Susan', 'Mavris', 6500, 780.0), ('Hermann', 'Baer', 10000, 1200.0), ('Shelley', 'Higgins', 12000, 1440.0), ('William', 'Gietz', 8300, 996.0)]

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

In [9]:
cur.execute('select employee_id, first_name, last_name, salary from employees order by salary asc')
print(cur.fetchall())

[(132, 'TJ', 'Olson', 2100), (128, 'Steven', 'Markle', 2200), (136, 'Hazel', 'Philtanker', 2200), (127, 'James', 'Landry', 2400), (135, 'Ki', 'Gee', 2400), (119, 'Karen', 'Colmenares', 2500), (131, 'James', 'Marlow', 2500), (140, 'Joshua', 'Patel', 2500), (144, 'Peter', 'Vargas', 2500), (182, 'Martha', 'Sullivan', 2500), (191, 'Randall', 'Perkins', 2500), (118, 'Guy', 'Himuro', 2600), (143, 'Randall', 'Matos', 2600), (198, 'Donald', 'OConnell', 2600), (199, 'Douglas', 'Grant', 2600), (126, 'Irene', 'Mikkilineni', 2700), (139, 'John', 'Seo', 2700), (117, 'Sigal', 'Tobias', 2800), (130, 'Mozhe', 'Atkinson', 2800), (183, 'Girard', 'Geoni', 2800), (195, 'Vance', 'Jones', 2800), (116, 'Shelli', 'Baida', 2900), (134, 'Michael', 'Rogers', 2900), (190, 'Timothy', 'Gates', 2900), (187, 'Anthony', 'Cabrio', 3000), (197, 'Kevin', 'Feeney', 3000), (115, 'Alexander', 'Khoo', 3100), (142, 'Curtis', 'Davies', 3100), (181, 'Jean', 'Fleaur', 3100), (196, 'Alana', 'Walsh', 3100), (125, 'Julia', 'Nayer', 3200), (138, 'Stephen', 'Stiles', 3200), (180, 'Winston', 'Taylor', 3200), (194, 'Samuel', 'McCain', 3200), (129, 'Laura', 'Bissot', 3300), (133, 'Jason', 'Mallin', 3300), (186, 'Julia', 'Dellinger', 3400), (141, 'Trenna', 'Rajs', 3500), (137, 'Renske', 'Ladwig', 3600), (189, 'Jennifer', 'Dilly', 3600), (188, 'Kelly', 'Chung', 3800), (193, 'Britney', 'Everett', 3900), (192, 'Sarah', 'Bell', 4000), (185, 'Alexis', 'Bull', 4100), (107, 'Diana', 'Lorentz', 4200), (184, 'Nandita', 'Sarchand', 4200), (200, 'Jennifer', 'Whalen', 4400), (105, 'David', 'Austin', 4800), (106, 'Valli', 'Pataballa', 4800), (124, 'Kevin', 'Mourgos', 5800), (104, 'Bruce', 'Ernst', 6000), (202, 'Pat', 'Fay', 6000), (173, 'Sundita', 'Kumar', 6100), (167, 'Amit', 'Banda', 6200), (179, 'Charles', 'Johnson', 6200), (166, 'Sundar', 'Ande', 6400), (123, 'Shanta', 'Vollman', 6500), (203, 'Susan', 'Mavris', 6500), (165, 'David', 'Lee', 6800), (113, 'Luis', 'Popp', 6900), (155, 'Oliver', 'Tuvault', 7000), (161, 'Sarath', 'Sewall', 7000), (178, 'Kimberely', 'Grant', 7000), (164, 'Mattea', 'Marvins', 7200), (172, 'Elizabeth', 'Bates', 7300), (171, 'William', 'Smith', 7400), (154, 'Nanette', 'Cambrault', 7500), (160, 'Louise', 'Doran', 7500), (111, 'Ismael', 'Sciarra', 7700), (112, 'Jose Manuel', 'Urman', 7800), (122, 'Payam', 'Kaufling', 7900), (120, 'Matthew', 'Weiss', 8000), (153, 'Christopher', 'Olsen', 8000), (159, 'Lindsey', 'Smith', 8000), (110, 'John', 'Chen', 8200), (121, 'Adam', 'Fripp', 8200), (206, 'William', 'Gietz', 8300), (177, 'Jack', 'Livingston', 8400), (176, 'Jonathon', 'Taylor', 8600), (175, 'Alyssa', 'Hutton', 8800), (103, 'Alexander', 'Hunold', 9000), (109, 'Daniel', 'Faviet', 9000), (152, 'Peter', 'Hall', 9000), (158, 'Allan', 'McEwen', 9000), (151, 'David', 'Bernstein', 9500), (157, 'Patrick', 'Sully', 9500), (163, 'Danielle', 'Greene', 9500), (170, 'Tayler', 'Fox', 9600), (150, 'Peter', 'Tucker', 10000), (156, 'Janette', 'King', 10000), (169, 'Harrison', 'Bloom', 10000), (204, 'Hermann', 'Baer', 10000), (149, 'Eleni', 'Zlotkey', 10500), (162, 'Clara', 'Vishney', 10500), (114, 'Den', 'Raphaely', 11000), (148, 'Gerald', 'Cambrault', 11000), (174, 'Ellen', 'Abel', 11000), (168, 'Lisa', 'Ozer', 11500), (108, 'Nancy', 'Greenberg', 12000), (147, 'Alberto', 'Errazuriz', 12000), (205, 'Shelley', 'Higgins', 12000), (201, 'Michael', 'Hartstein', 13000), (146, 'Karen', 'Partners', 13500), (145, 'John', 'Russell', 14000), (101, 'Neena', 'Kochhar', 17000), (102, 'Lex', 'De Haan', 17000), (100, 'Steven', 'King', 24000)]

+ Write a query to get the total salaries payable to employees on the table "employees"

In [10]:
cur.execute('select sum(salary) from employees')
print(cur.fetchall())

[(691400,)]

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

In [11]:
cur.execute('select max(salary), min(salary) from employees')
print(cur.fetchall())

[(24000, 2100)]

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

In [12]:
cur.execute('select avg(salary), count(salary) from employees')
print(cur.fetchall())

[(6461.682242990654, 107)]

+ Write a query to get the number of employees working with the company on the table "employees"

In [13]:
cur.execute("select count(first_name) from employees")
print(cur.fetchall())

[(107,)]

+ Write a query to get the number of jobs available in the employees table on the table "employees"

OperationalError: no such table: job

In [14]:
cur.execute("SELECT sql FROM sqlite_master WHERE tbl_name = 'employees' AND type = 'table'")
print(cur.fetchall())

[('CREATE TABLE employees(\nemployee_id integer(3) primary key not null,\nfirst_name varchar(20),\nlast_name varchar(25),\nemail varchar(25),\nphone_number varchar(20),\nhire_date date,\njob_id varchar(10) not null,\nsalary decimal,\ncommission_pct number,\nmanager_id integer(3),\ndepartment_id integer(3), Avg_Salary NUMERIC)',)]

+ Write a query get all first name from employees table in upper case on the table "employees"

In [15]:
cur.execute("select UPPER(first_name) from employees")
print(cur.fetchall())

[('STEVEN',), ('NEENA',), ('LEX',), ('ALEXANDER',), ('BRUCE',), ('DAVID',), ('VALLI',), ('DIANA',), ('NANCY',), ('DANIEL',), ('JOHN',), ('ISMAEL',), ('JOSE MANUEL',), ('LUIS',), ('DEN',), ('ALEXANDER',), ('SHELLI',), ('SIGAL',), ('GUY',), ('KAREN',), ('MATTHEW',), ('ADAM',), ('PAYAM',), ('SHANTA',), ('KEVIN',), ('JULIA',), ('IRENE',), ('JAMES',), ('STEVEN',), ('LAURA',), ('MOZHE',), ('JAMES',), ('TJ',), ('JASON',), ('MICHAEL',), ('KI',), ('HAZEL',), ('RENSKE',), ('STEPHEN',), ('JOHN',), ('JOSHUA',), ('TRENNA',), ('CURTIS',), ('RANDALL',), ('PETER',), ('JOHN',), ('KAREN',), ('ALBERTO',), ('GERALD',), ('ELENI',), ('PETER',), ('DAVID',), ('PETER',), ('CHRISTOPHER',), ('NANETTE',), ('OLIVER',), ('JANETTE',), ('PATRICK',), ('ALLAN',), ('LINDSEY',), ('LOUISE',), ('SARATH',), ('CLARA',), ('DANIELLE',), ('MATTEA',), ('DAVID',), ('SUNDAR',), ('AMIT',), ('LISA',), ('HARRISON',), ('TAYLER',), ('WILLIAM',), ('ELIZABETH',), ('SUNDITA',), ('ELLEN',), ('ALYSSA',), ('JONATHON',), ('JACK',), ('KIMBERELY',), ('CHARLES',), ('WINSTON',), ('JEAN',), ('MARTHA',), ('GIRARD',), ('NANDITA',), ('ALEXIS',), ('JULIA',), ('ANTHONY',), ('KELLY',), ('JENNIFER',), ('TIMOTHY',), ('RANDALL',), ('SARAH',), ('BRITNEY',), ('SAMUEL',), ('VANCE',), ('ALANA',), ('KEVIN',), ('DONALD',), ('DOUGLAS',), ('JENNIFER',), ('MICHAEL',), ('PAT',), ('SUSAN',), ('HERMANN',), ('SHELLEY',), ('WILLIAM',)]

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

In [16]:
cur.execute("select substr(first_name,0,4) from employees")
print(cur.fetchall())

[('Ste',), ('Nee',), ('Lex',), ('Ale',), ('Bru',), ('Dav',), ('Val',), ('Dia',), ('Nan',), ('Dan',), ('Joh',), ('Ism',), ('Jos',), ('Lui',), ('Den',), ('Ale',), ('She',), ('Sig',), ('Guy',), ('Kar',), ('Mat',), ('Ada',), ('Pay',), ('Sha',), ('Kev',), ('Jul',), ('Ire',), ('Jam',), ('Ste',), ('Lau',), ('Moz',), ('Jam',), ('TJ',), ('Jas',), ('Mic',), ('Ki',), ('Haz',), ('Ren',), ('Ste',), ('Joh',), ('Jos',), ('Tre',), ('Cur',), ('Ran',), ('Pet',), ('Joh',), ('Kar',), ('Alb',), ('Ger',), ('Ele',), ('Pet',), ('Dav',), ('Pet',), ('Chr',), ('Nan',), ('Oli',), ('Jan',), ('Pat',), ('All',), ('Lin',), ('Lou',), ('Sar',), ('Cla',), ('Dan',), ('Mat',), ('Dav',), ('Sun',), ('Ami',), ('Lis',), ('Har',), ('Tay',), ('Wil',), ('Eli',), ('Sun',), ('Ell',), ('Aly',), ('Jon',), ('Jac',), ('Kim',), ('Cha',), ('Win',), ('Jea',), ('Mar',), ('Gir',), ('Nan',), ('Ale',), ('Jul',), ('Ant',), ('Kel',), ('Jen',), ('Tim',), ('Ran',), ('Sar',), ('Bri',), ('Sam',), ('Van',), ('Ala',), ('Kev',), ('Don',), ('Dou',), ('Jen',), ('Mic',), ('Pat',), ('Sus',), ('Her',), ('She',), ('Wil',)]

+ Write a query to calculate 171*214+625.

In [17]:
df = pd.read_sql("select 171*214+625", conn)
df.head()

   171*214+625
0        37219

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

In [18]:
df = pd.read_sql("select first_name ||' '||last_name as full_name from employees", conn)
df.head()

          full_name
0       Steven King
1     Neena Kochhar
2       Lex De Haan
3  Alexander Hunold
4       Bruce Ernst

+ Write a query to get first name from employees table after removing white spaces from both side on the table "employees"

In [19]:
df = pd.read_sql("select TRIM(first_name) from employees", conn)
df.head()

  TRIM(first_name)
0           Steven
1            Neena
2              Lex
3        Alexander
4            Bruce

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

In [20]:
df = pd.read_sql("select length(first_name ||' '|| last_name) from employees", conn)
df.head()

   length(first_name ||' '|| last_name)
0                                    11
1                                    13
2                                    11
3                                    16
4                                    11

+ Write a query to select first 10 records from a table on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

In [21]:
df = pd.read_sql("select* from employees limit 10", conn)
df.head()

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id,Avg_Salary
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000,0,0,90,None
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1987-06-18,AD_VP,17000,0,100,90,None
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1987-06-19,AD_VP,17000,0,100,90,None
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1987-06-20,IT_PROG,9000,0,102,60,None
4,104,Bruce,Ernst,BERNST,590.423.4568,1987-06-21,IT_PROG,6000,0,103,60,None

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"

In [22]:

df = pd.read_sql("select first_name, sum(salary)/12 from employees group by employee_id, substr(hire_date,6,2)", conn)
df.head()

  first_name  sum(salary)/12
0     Steven            2000
1      Neena            1416
2        Lex            1416
3  Alexander             750
4      Bruce             500

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

In [23]:

df = pd.read_sql("select first_name, last_name, salary from employees where not(salary > 10000 and salary < 15000)", conn)
df.head()

  first_name last_name  salary
0     Steven      King   24000
1      Neena   Kochhar   17000
2        Lex   De Haan   17000
3  Alexander    Hunold    9000
4      Bruce     Ernst    6000

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

In [24]:
df = pd.read_sql("select first_name, last_name from employees where department_id = 30 or department_id = 100 order by department_id, first_name asc", conn)
df.head()

  first_name   last_name
0  Alexander        Khoo
1        Den    Raphaely
2        Guy      Himuro
3      Karen  Colmenares
4     Shelli       Baida

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

In [25]:
df = pd.read_sql("select first_name, last_name from employees where (department_id = 30 or department_id = 100) and not(salary > 10000 and salary < 15000)", conn)
df.head()

    first_name last_name
0       Daniel    Faviet
1         John      Chen
2       Ismael   Sciarra
3  Jose Manuel     Urman
4         Luis      Popp

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

In [26]:
df = pd.read_sql("select first_name from employees where first_name LIKE '%b%' and first_name like '%c%' ", conn)
df.head()

  first_name
0      Bruce

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

In [27]:
df = pd.read_sql("""
select e.last_name, e.job_id, e.salary, j.job_title
from employees as e 
inner join jobs as j 
ON e.job_id = j.job_id
where (j.job_title = 'Programmer' or j.job_title = 'Shipping Clerk')and not(e.salary = 4500 or e.salary = 10000 or e.salary = 15000)""", conn)
df.head()

   last_name   job_id  salary   job_title
0     Hunold  IT_PROG    9000  Programmer
1      Ernst  IT_PROG    6000  Programmer
2     Austin  IT_PROG    4800  Programmer
3  Pataballa  IT_PROG    4800  Programmer
4    Lorentz  IT_PROG    4200  Programmer

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

In [28]:
df = pd.read_sql("select last_name from employees where length(last_name)==6",conn)
df.head()

  last_name
0    Hunold
1    Austin
2    Faviet
3    Tobias
4    Himuro

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

In [29]:
df = pd.read_sql("select last_name from employees where substr(last_name,3,1)='e'",conn)
df.head()

   last_name
0  Greenberg
1       Chen
2        Gee
3     Greene
4        Lee

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

In [33]:
df = pd.read_sql("SELECT* from employees", conn)
df.head()
#####Falta terminar

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id,Avg_Salary
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000,0.0,0,90,None
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1987-06-18,AD_VP,17000,0.0,100,90,None
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1987-06-19,AD_VP,17000,0.0,100,90,None
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1987-06-20,IT_PROG,9000,0.0,102,60,None
4,104,Bruce,Ernst,BERNST,590.423.4568,1987-06-21,IT_PROG,6000,0.0,103,60,None

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

In [37]:
df = pd.read_sql("Select first_name||' '||last_name as name, salary, salary*0.15 as PF from employees",conn)
df.head()

               name  salary      PF
0       Steven King   24000  3600.0
1     Neena Kochhar   17000  2550.0
2       Lex De Haan   17000  2550.0
3  Alexander Hunold    9000  1350.0
4       Bruce Ernst    6000   900.0

+ Write a query to list the number of jobs available in the employees table.

In [41]:
df = pd.read_sql("Select count(distinct(job_id)) from employees",conn)
df.head()

### Falta terminar

   count(distinct(job_id))
0                       19

+ Write a query to get the total salaries payable to employees.

In [43]:
df = pd.read_sql("SELECT sum(salary) from employees", conn)
df.head()

   sum(salary)
0       691400

+ Write a query to get the minimum salary from employees table.

In [44]:
df = pd.read_sql("SELECT min(salary) from employees", conn)
df.head()

   min(salary)
0         2100

+ Write a query to get the maximum salary of an employee working as a Programmer.

In [56]:
df = pd.read_sql("SELECT max(salary) from employees where job_id = 'IT_PROG'", conn)
df.head()

   max(salary)
0         9000

+ Write a query to get the average salary and number of employees working the department 90.

In [63]:
df = pd.read_sql("SELECT count(employee_id), avg(salary) from employees WHERE department_id=90 GROUP BY department_id", conn)
df.head()

   count(employee_id)   avg(salary)
0                   3  19333.333333

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

In [64]:
df = pd.read_sql("SELECT max(salary), min(salary), sum(salary), avg(salary) from employees", conn)
df.head()

   max(salary)  min(salary)  sum(salary)  avg(salary)
0        24000         2100       691400  6461.682243

+ Write a query to get the number of employees with the same job.

In [66]:
df = pd.read_sql("SELECT count(job_id) from employees GROUP BY job_id", conn)
df.head()
#######################Falta revisar

   count(job_id)
0              1
1              1
2              1
3              1
4              2

+ Write a query to get the difference between the highest and lowest salaries.

In [69]:
df = pd.read_sql("SELECT max(salary)-min(salary) from employees", conn)
df.head()

   max(salary)-min(salary)
0                    21900

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

In [74]:
df = pd.read_sql("SELECT manager_id, min(salary) from employees group by manager_id", conn)
df.head()

   manager_id  min(salary)
0           0        24000
1         100         5800
2         101         4400
3         102         9000
4         103         4200

+ Write a query to get the department ID and the total salary payable in each department.

In [78]:
df = pd.read_sql("SELECt department_id, sum(salary) from employees group by department_id", conn)
df.head()

   department_id  sum(salary)
0              0         7000
1             10         4400
2             20        19000
3             30        24900
4             40         6500

+ Write a query to get the average salary for each job ID excluding programmer.

In [81]:
df = pd.read_sql("SELECT job_id, avg(salary) from employees where job_id != 'IT_PROG' group by job_id", conn)
df.head()

       job_id  avg(salary)
0  AC_ACCOUNT       8300.0
1      AC_MGR      12000.0
2     AD_ASST       4400.0
3     AD_PRES      24000.0
4       AD_VP      17000.0

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

In [82]:
df = pd.read_sql("SELECT salary, max(salary), min(salary), avg(salary) from employees where department_id=90 ", conn)
df.head()
###### job_id wise

   salary  max(salary)  min(salary)   avg(salary)
0   17000        24000        17000  19333.333333

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

In [92]:
df = pd.read_sql("SELECT job_id, max(salary) from employees where salary > 4000 group by job_id ", conn)
df.head()
######## REVISAR

       job_id  max(salary)
0  AC_ACCOUNT         8300
1      AC_MGR        12000
2     AD_ASST         4400
3     AD_PRES        24000
4       AD_VP        17000

+ Write a query to get the average salary for all departments employing more than 10 employees.

In [114]:
df = pd.read_sql("SELECT avg(salary), department_id from employees where(SELECT count(job_id) from employees)>10 group by department_id", conn)
df.head()
########## REVISAR

   avg(salary)  department_id
0       7000.0              0
1       4400.0             10
2       9500.0             20
3       4150.0             30
4       6500.0             40

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

In [124]:
df = pd.read_sql("SELECT first_name||' '||last_name as name, salary department_id from employees where salary>(select salary from employees where last_name='Bull')", conn)
df.head()

               name  department_id
0       Steven King          24000
1     Neena Kochhar          17000
2       Lex De Haan          17000
3  Alexander Hunold           9000
4       Bruce Ernst           6000

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

In [136]:
df = pd.read_sql("""SELECT e.first_name||' '||e.last_name as name, d.department_name
from employees as e
INNER JOIN department as d
ON d.department_id = e.department_id
where d.department_name='IT' """, conn)

df.head()

               name department_name
0  Alexander Hunold              IT
1       Bruce Ernst              IT
2      David Austin              IT
3     Diana Lorentz              IT
4   Valli Pataballa              IT

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

In [24]:
#df= pd.read_sql("""
#create view full_loc as
#select * 
#from department as d
#inner join locations as l
#on l.location_id = l.location_id
#where country_id = 'US'
#""", conn)

df = pd.read_sql(""" 
SELECT e.first_name||' '||e.last_name as name, l.country_id
from employees as e
inner join full_loc as l
using(manager_id)
where l.country_id='US'
""",conn)
df.head()

             name country_id
0         Pat Fay         US
1         Pat Fay         US
2         Pat Fay         US
3         Pat Fay         US
4  Alexander Khoo         US

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

In [50]:
df = pd.read_sql("""
select first_name||' '|| last_name as name
from employees as e
where employee_id 
in (select manager_id from employees)
""",conn)
df.head(30)

                 name
0         Steven King
1       Neena Kochhar
2         Lex De Haan
3    Alexander Hunold
4     Nancy Greenberg
5        Den Raphaely
6       Matthew Weiss
7          Adam Fripp
8      Payam Kaufling
9      Shanta Vollman
10      Kevin Mourgos
11       John Russell
12     Karen Partners
13  Alberto Errazuriz
14   Gerald Cambrault
15      Eleni Zlotkey
16  Michael Hartstein
17    Shelley Higgins

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

In [55]:
df= pd.read_sql("""
select first_name||' '|| last_name as name, salary
from employees
where
salary > (select avg(salary) from employees)
""",conn)
df.head()

               name  salary
0       Steven King   24000
1     Neena Kochhar   17000
2       Lex De Haan   17000
3  Alexander Hunold    9000
4   Nancy Greenberg   12000

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

In [71]:
df= pd.read_sql("""
select *
from employees
where (salary, job_id) in (select min(salary),job_id from employees group by job_id)
""",conn)
df.head(10)
##Falta revisar

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id,Avg_Salary
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000,0.0,0,90,None
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1987-06-18,AD_VP,17000,0.0,100,90,None
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1987-06-19,AD_VP,17000,0.0,100,90,None
3,107,Diana,Lorentz,DLORENTZ,590.423.5567,1987-06-24,IT_PROG,4200,0.0,103,60,None
4,108,Nancy,Greenberg,NGREENBE,515.124.4569,1987-06-25,FI_MGR,12000,0.0,101,100,None
5,113,Luis,Popp,LPOPP,515.124.4567,1987-06-30,FI_ACCOUNT,6900,0.0,108,100,None
6,114,Den,Raphaely,DRAPHEAL,515.127.4561,1987-07-01,PU_MAN,11000,0.0,100,30,None
7,119,Karen,Colmenares,KCOLMENA,515.127.4566,1987-07-06,PU_CLERK,2500,0.0,114,30,None
8,124,Kevin,Mourgos,KMOURGOS,650.123.5234,1987-07-11,ST_MAN,5800,0.0,100,50,None
9,132,TJ,Olson,TJOLSON,650.124.8234,1987-07-19,ST_CLERK,2100,0.0,121,50,None

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

In [88]:
df= pd.read_sql("""
select e.first_name||' '||e.last_name as name, e.salary, d.department_name
from employees as e
inner join department as d
using (department_id)
where d.department_name = 'IT' and  e.salary > (select avg(salary) from employees)
""",conn)
df.head(60)

##Revisar de leve

               name  salary department_name
0  Alexander Hunold    9000              IT

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

In [98]:
df= pd.read_sql("""
select e.first_name||' '||e.last_name as name, e.salary
from employees as e
where e.salary > (select salary from employees where last_name = 'Bell')
""",conn)
df.head()
#Analisar por que Bell é um mulher sendo que a questão passa o nome "Mr."
####Revisar

               name  salary
0       Steven King   24000
1     Neena Kochhar   17000
2       Lex De Haan   17000
3  Alexander Hunold    9000
4       Bruce Ernst    6000

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

In [100]:
df= pd.read_sql("""
select e.first_name||' '||e.last_name as name, e.salary
from employees as e
where e.salary = (select min(salary) from employees)
""",conn)
df.head()
#Revisar interretação da questão

       name  salary
0  TJ Olson    2100

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

In [132]:
df= pd.read_sql("""
select *
from employees as e
inner join departments
using(manager_id)
j.job_title = 'Supervisor'
""",conn)

df.head()


##### Revisar o que são os supervisors

   region_id             region_name
0  REGION_ID             REGION_NAME
1          1                  Europe
2          2                Americas
3          3                    Asia
4          4  Middle East and Africa

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

In [148]:
### Ainda não sei como fazer

+ Write a query to find the 5th maximum salary in the employees table.

In [160]:
df= pd.read_sql("""
select distinct salary
from employees
order by salary desc
limit 1 OFFSET 4
""",conn)
#13000
df.head()

   salary
0   13000

+ Write a query to find the 4th minimum salary in the employees table.

In [167]:
df= pd.read_sql("""
select distinct salary
from employees
order by salary asc
limit 1 OFFSET 3
""",conn)
#2500
df.head()

   salary
0    2500

+ Write a query to select last 10 records from a table.

In [170]:
df= pd.read_sql("""
select *
from employees
order by hire_date desc
limit 10
""",conn)
df.head()
#Dá uma revisada

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id,Avg_Salary
0,206,William,Gietz,WGIETZ,515.123.8181,1987-10-01,AC_ACCOUNT,8300,1,205,110,None
1,205,Shelley,Higgins,SHIGGINS,515.123.8080,1987-09-30,AC_MGR,12000,1,101,110,None
2,204,Hermann,Baer,HBAER,515.123.8888,1987-09-29,PR_REP,10000,0,101,70,None
3,203,Susan,Mavris,SMAVRIS,515.123.7777,1987-09-28,HR_REP,6500,0,101,40,None
4,202,Pat,Fay,PFAY,603.123.6666,1987-09-27,MK_REP,6000,0,201,20,None

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

In [171]:
###Falta fazer mas não é difícil

  department_id  department_name manager_id location_id
0            10   Administration        200        1700
1            20        Marketing        201        1800
2            30       Purchasing        114        1700
3            40  Human Resources        203        2400
4            50         Shipping        121        1500

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

In [184]:
df= pd.read_sql("""
select l.location_id, l.street_address, l.city, l.state_province, c.country_name
from department as d
inner join locations as l, countries as c 
on l.location_id = d.location_id and c.country_id = l.country_id
""",conn)
df.head()

,location_id,street_address,city,state_province,country_name
0,1700,2004 Charade Rd,Seattle,Washington,United States of America
1,1800,147 Spadina Ave,Toronto,Ontario,Canada
2,1700,2004 Charade Rd,Seattle,Washington,United States of America
3,2400,8204 Arthur St,London,,United Kingdom
4,1500,2011 Interiors Blvd,South San Francisco,California,United States of America

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

In [ ]:
### Não entendi a questão
### é só fazer uma query sem retrições do employee?

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

+ Write a query to get the department name and number of employees in the department.

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

+ Write a query to display the department ID, department name, and manager first name.

+ Write a query to display the department name, manager name, and city.

+ Write a query to display the job title and average salary of employees.

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.